"u8sdk_current_language_type" = "zh-TW";
"u8_language_type_key" = "繁体中文";

"u8_privacy_policy_guidelines" = "隱私協議保護指引";
"u8_privacy_detail_thank" =  "感謝您使用本遊戲,您使用本遊戲應當仔細閱讀並同意,我們將會收集您的設備信息。";
"u8_user_services_agreement" = "《用戶服務協議》";
"u8_user_privacy_agreement" = "《用戶隱私協議》";
"u8_privacy_detail_content" = ",如您拒絕將無法進入遊戲。請點擊同意開始向您提供我們的服務。為向您提供遊戲服務,我們可能在您使用過程中,獲取以下權限及信息,您可以在設備中查看並管理您的權限。\n設備信息:為方便您找回丟失的賬號密碼,保障賬號安全。";
"u8_privacy_detail_all" = "感謝您使用本遊戲,您使用本遊戲應當仔細閱讀並同意,我們將會收集您的設備信息。《用戶服務協議》及《用戶隱私協議》,,如您拒絕將無法進入遊戲。請點擊同意開始向您提供我們的服務。為向您提供遊戲服務,我們可能在您使用過程中,獲取以下權限及信息,您可以在設備中查看並管理您的權限。\n設備信息:為方便您找回丟失的賬號密碼,保障賬號安全。";

"u8_user_exit_APP" = "退出應用";
"u8_user_exit_login" = "成功退出登錄";
"u8_user_loginSuccess_welcome" = "登入成功，歡迎您!";




"u8_error_data_error" = "數據異常";
"u8_error_unknown_error" = "未知錯誤";
"u8_error_parameter_error" = "參數錯誤";
"u8_error_name_invalid" = "姓名或號碼不合法";
"u8_error_code_unsend" = "錯誤，驗證碼無法發送";
"u8_error_system_versionLow" = "系統版本過低,要求iOS 13+";

"u8_tips_button_yes" = "是";
"u8_tips_button_no" = "否";
"u8_tips_button_ok" = "確定";
"u8_tips_button_cancel" = "取消";
"u8_tips_button_unBind" = "未綁定";
"u8_tips_button_alreadyBind" = "已綁定";

"u8_account_login_success" = "登入成功";
"u8_account_login_failed" = "登入失敗";
"u8_account_bind_success" = "綁定成功";
"u8_account_bind_failed" = "綁定失敗";
"u8_account_unbind_success" = "解綁成功";
"u8_account_unbind_failed" = "解綁失敗";
"u8_account_cutover_success" = "切換帳號成功";
"u8_account_cutover_failed" = "切換帳號失敗";
"u8_account_cutover_abnormal" = "切換賬號異常";
"u8_account_verify_failed" = "驗證賬號狀態失敗";
"u8_account_please_login" = "請先登錄";
"u8_account_realname_success" = "實名認證成功";
"u8_account_realname_failed" = "實名認證失敗";
"u8_account_realname_verified" = "實名認證";

"u8_account_realname_noPass" = "未通過實名";
"u8_account_realname_pass" = "已通過實名";
"u8_account_realname_tips1" = "根據國家相法律規定，玩家需實名認證，為了您的遊戲體驗，請填寫身份信息，否則將無法正常遊戲。";
"u8_account_realname_tips2" = "根據《關於防止未成年人沉迷網絡遊戲的通知》，遊戲用戶應使用有效身份證件實名註冊，我們承諾將依法保護您的個人信息安全。";
"u8_account_UI_realname" = "真實姓名";
"u8_account_UI_numberCard" = "身份證號";
"u8_account_UI_commit" = "提交";
"u8_account_UI_current" = "當前帳號";
"u8_account_UI_agreement" = "使用者協定";
"u8_account_UI_service" = "聯繫客服";
"u8_account_UI_bind" = "綁定";
"u8_account_UI_unbind" = "解綁";
"u8_account_UI_cutoverBind" = "切換綁定";
"u8_account_UI_noBind" = "暫無綁定";
"u8_account_UI_alreadyBind" = "已經綁定";
"u8_account_UI_agree" = "同意";

"u8_account_bind_tips1" = "綁定代表同意";
"u8_account_privacy_policy" = "隱私政策";
"u8_account_code_sending" = "正在發送";

"u8_account_show_copySuccess" = "複製成功";

"u8_account_center_tips" = "為了確保您的遊戲數據不會遺失，我們建議您綁定帳號，且您的帳號綁定後您可以在其他設備上登入";
"u8_account_title_info" = "帳號資訊";
"u8_account_title_bind" = "帳號綁定";
"u8_account_title_bindOrCutover" = "綁定或切換";
"u8_account_input_phoneNumber" = "請輸入手機號";
"u8_account_verification_code" = "驗證碼";
"u8_account_get_code" = "獲取驗證碼";
"u8_account_code_send" = "正在發送";
"u8_account_please_wait" = "請稍等一會~";
"u8_account_oneClick_login" = "本機號碼一鍵綁定";
"u8_account_other_bind" = "其他綁定方式";
"u8_account_getJGParameter_success" = "獲取一鍵登錄參數成功";
"u8_account_tips_pleaseAgree" = "請先同意相關條款和協議";
"u8_account_request_unHandle" = "無法處理該行為";
"u8_account_login_noSupport" = "暫不支持該登錄方式";

"u8_no_plugin_wx" = "缺少微信插件";
"u8_no_plugin_qq" = "缺少QQ插件";
"u8_no_plugin_fb" = "缺少Facebook插件";
"u8_no_plugin_gg" = "缺少Google插件";
"u8_no_plugin_any" = "沒有發現該平台插件";
"u8_no_plugin_account" = "缺少賬號體系插件";
//"u8_no_plugin_wx" = "缺少微信插件";
//"u8_no_plugin_wx" = "缺少微信插件";
//"u8_no_plugin_wx" = "缺少微信插件";

"u8_no_open_apple" = "未開啟蘋果登錄模塊";
"u8_no_open_wx" = "未開啟微信登錄模塊";
//"u8_no_open_apple" = "未開啟蘋果登錄模塊";

"u8_no_install_wx" = "未安裝微信";

"u8_lack_module_fb" = "未開啟Facebook模塊";
"u8_lack_module_gg" = "未開啟google登錄模塊";

"u8_wx_error_nodate" = "微信授權已過期";
"u8_wx_error_open" = "打開微信失敗";
"u8_wx_error_login" = "微信登入失敗";
"u8_wx_error_authorize" = "微信授權失敗";
"u8_wx_success_authorize" = "微信授權成功";


"u8_ad_error_award" = "獎勵發放失敗";
"u8_ad_error_cacheTimes" = "緩存次數必須大於0";
"u8_ad_error_show" = "廣告展示失敗";

"u8_account_platform_alreadyBind" = "你已經綁定過該平台";
"u8_account_platform_noBind" = "你未綁定過該平台";
"u8_account_platform_unBind" = "賬號解綁";
"u8_account_platform_unBindTips" = "你確定需要解綁嗎？";

"u8_phone_save_failed" = "圖片保存到相冊失敗";
"u8_phone_save_success" = "圖片保存到相冊成功";

"u8_apple_login_canceled" = "取消了授權登錄請求";
"u8_apple_login_failed" = "授權請求失敗";
"u8_apple_login_invalidResponse" = "授權請求響應無效";
"u8_apple_login_notHandled" = "未能處理授權請求";
"u8_apple_login_unknown" = "授權請求失敗未知原因";
"u8_apple_login_success" = "蘋果授權登入成功";

"u8_apple_pay_failed" = "支付失敗";
"u8_apple_no_open" = "您未打開應用內付費購買功能";
"u8_apple_create_order" = "正在創建訂單";
"u8_apple_link_AppStore" = "正在連接App Store";
"u8_apple_create_orderFailed" = "訂單創建失敗";
"u8_apple_product_noFind" = "找不到商品信息";
"u8_apple_buy_waiting" = "購買中,請稍後";
"u8_apple_ok_waiting" = "等待確認中,請稍後";
"u8_apple_return_buyData" = "正在返回購買數據";
"u8_apple_lost_orderData" = "訂單信息已丟失";
"u8_apple_pay_buyFailed" = "購買失敗";
"u8_apple_pay_receiptURLFailed" = "無法獲取ReceiptURL";
"u8_apple_pay_success" = "購買成功";
"u8_apple_shipment_failed" = "發貨失敗";
"u8_apple_no_handle" = "無法支付";
"u8_apple_order_handle" = "正在處理訂單中...";
"u8_apple_order_handleNum" = "正在處理第%ld筆訂單";
"u8_apple_shipment_success" = "發貨成功";
"u8_apple_order_handleOver" = "訂單處理完成";
"u8_apple_order_failedAll" = "訂單處理失敗,請檢查您當前的網絡環境。如若網絡環境無異常，可嘗試退出當前當遊戲，然後重新進入。";
"u8_apple_order_failedPart" = "訂單處理完成，其中%ld筆訂單處理失敗,請檢查您當前的網絡環境。如若網絡環境無異常，可嘗試退出當前遊戲，然後重新進入。";
"u8_apple_order_noti" = "提示";
"u8_apple_order_sure" = "確定";
"u8_apple_order_willHandle"= "你有%ld筆支付訂單未處理，現在開始為你處理。";

"u8_applePay_failedStatus_1" = "取消支付";
"u8_applePay_failedStatus_2" = "發生未知或意外錯誤";
"u8_applePay_failedStatus_3" = "客戶端不允許發送請求";
"u8_applePay_failedStatus_4" = "App Store無法識別付款參數";
"u8_applePay_failedStatus_5" = "設備不允許付款";
"u8_applePay_failedStatus_6" = "所請求的產品在商店中不可用";
"u8_applePay_failedStatus_7" = "不允許訪問云服務信息";
"u8_applePay_failedStatus_8" = "設備無法連接到網絡";
"u8_applePay_failedStatus_9" = "已撤消使用此云服務的權限";
"u8_applePay_failedStatus_10" = "用戶需要同意蘋果的隱私政策";
"u8_applePay_failedStatus_11" = "程序不具備訪問該屬性權限";
"u8_applePay_failedStatus_12" = "找不到報價標識符或該報價標識符無效";
"u8_applePay_failedStatus_13" = "提供的加密簽名無效";
"u8_applePay_failedStatus_14" = "缺少一個或多個參數";
"u8_applePay_failedStatus_15" = "所選報價的價格無效";
"u8_applePay_failedStatus_16" = "發生了未知的錯誤";

"u8_appleProduct_question_success" = "商品信息查詢成功";
"u8_appleProduct_question_failed" = "商品信息查詢失敗";
"u8_appleProduct_ID_Null" = "商品ID為空";
"u8_appleProduct_getInfo_load" = "正在獲取商品信息";
"u8_appleProduct_request_timeout" = "請求超時";

"u8_share_share_success" = "分享成功";
"u8_share_share_failed" = "分享失敗";
"u8_share_share_cancel" = "取消分享";

"u8_web_tips_loadFailed" = "加載失敗,請檢查網絡";

"u8_account_UI_otherPhone" = "其他手機號登錄";
"u8_account_UI_loginAndBind" = "本機號碼一鍵登錄註冊";
"u8_account_UI_phoneLogin" = "手機號登錄";
"u8_account_UI_phoneLoginDetail" = "未註冊手機號驗證後將直接註冊";
"u8_account_bind_tips1" = "綁定代表同意";
"u8_account_UI_sendCountdown" = "%ld秒後重新發送";
"u8_account_UI_phoneNumber" = "手機號";
"u8_account_UI_btnLogin" = "登錄";
"u8_account_UI_tipsCode" = "請輸入驗證碼";
"u8_account_UI_tipsPhone" = "請輸入合法的手機號";
"u8_account_UI_loginAgreement" = "登錄即同意";
"u8_account_UI_usePhone" = "並使用本機號碼登錄";
"u8_account_UI_loginQuestion" = "登錄相關問題";
"u8_account_UI_unableBind" = "無法綁定或登錄";
"u8_account_UI_contactService" = "聯繫客服";

"u8_account_complaint_complaint" = "換綁申訴";
"u8_account_complaint_enterAccount " = "實名驗證:輸入原帳號實名資訊";
"u8_account_complaint_originalPhone" = "原手機號碼";
"u8_account_complaint_inputRealname" = "請輸入真實姓名";
"u8_account_complaint_inputCardnumber" = "請輸入身份證號碼";
"u8_account_complaint_name" = "姓名";
"u8_account_complaint_enterAccount" = "實名驗證:輸入原帳號實名資訊";
"u8_account_complaint_tipsCardNumber" = "請輸入合法的身份證號碼";
"u8_account_info_account" = "帳號";
"u8_account_info_realName" = "實名";
"u8_account_info_memberCard" = "身份證";
"u8_account_info_cutoverBind" = "換綁";
"u8_account_info_cutoverAccount" = "切換帳號";
"u8_account_cutove_title" = "帳號換綁";
"u8_account_cutove_verify" = "驗證";
"u8_account_cutove_newPhone" = "新手機號碼";
"u8_account_cutove_accountCutover" = "帳號切換";
"u8_account_tips_cancelLogin" = "取消登錄";
"u8_account_tips_sendSMSFailed" = "短信發送失敗";
"u8_account_tips_jgloginFailed" = "本機號碼一鍵授權登錄失敗，請使用短信驗證碼方式登錄";
"u8_account_tips_phoneCheckPhone" = "手機校驗失敗";
"u8_account_tips_phoneCheckDifferent" = "所填寫的手機號碼必須與已登錄帳號手機號碼不相同";
"u8_account_tips_tokenIsNull" = "token is empty";
"u8_account_tips_submissionFailed" = "提交失敗";
"u8_account_tips_submissionSuccess" = "提交成功";
"u8_account_tips_appealChangeFailed" = "帳號申訴找回失敗";
"u8_account_appealSuccess_welcome" = "帳號申訴找回成功，歡迎您!";
"u8_account_cutoverSuccess_welcome" = "帳號切換成功，歡迎您!";
"u8_account_tips_loginTypeError" = "登錄方式錯誤";
"u8_account_UI_help" = "幫助";
